
read_liberty -lib ../stdCelllib/gscl45nm.lib
read -sv ../*.v
hierarchy -top full_adder_1
flatten
synth -top full_adder_1
flatten

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty ../stdCelllib/gscl45nm.lib

# mapping logic to mycells.lib
abc  -liberty ../stdCelllib/gscl45nm.lib
opt
opt
clean
opt
clean

write_blif -impltf ./blif/full_adder_1.blif

